//
//  BMDResolution.swift
//  Taurus
//
//  Created by 吴坤城 on 5/11/24.
//

import Foundation

func BMDResolution(cameradata:CameraData) -> [String] {
    
    var resolutions: [String] = []
    
    if cameradata.BrandName == "Blackmagicdesign" {
        
            let key = cameradata.CameraName + "_" + cameradata.Codec
            
            let BMDResolutions: [String: [String]] = [
                "Blackmagic URSA Mini Pro 12K_Blackmagic RAW 5:1" : ["12K S35[12288*6480][17:9]","12K S35[11520*6480][16:9]","12K S35[12288*5112][2.4:1]","8K S35[8192*4320][17:9]","8K S35[7680*4320][16:9]","8K S35[8192*3408][2.4:1]","4K S35[4096*2160][17:9]","4K S35[3840*2160][16:9]","4K S35[4096*1704][2.4:1]","6K S16[6144*3240][17:9]","4K S16[4096*2160][17:9]"],
                "Blackmagic URSA Mini Pro 12K_Blackmagic RAW 8:1" : ["12K S35[12288*6480][17:9]","12K S35[11520*6480][16:9]","12K S35[12288*5112][2.4:1]","8K S35[8192*4320][17:9]","8K S35[7680*4320][16:9]","8K S35[8192*3408][2.4:1]","4K S35[4096*2160][17:9]","4K S35[3840*2160][16:9]","4K S35[4096*1704][2.4:1]","6K S16[6144*3240][17:9]","4K S16[4096*2160][17:9]"],
                "Blackmagic URSA Mini Pro 12K_Blackmagic RAW 12:1" : ["12K S35[12288*6480][17:9]","12K S35[11520*6480][16:9]","12K S35[12288*5112][2.4:1]","8K S35[8192*4320][17:9]","8K S35[7680*4320][16:9]","8K S35[8192*3408][2.4:1]","4K S35[4096*2160][17:9]","4K S35[3840*2160][16:9]","4K S35[4096*1704][2.4:1]","6K S16[6144*3240][17:9]","4K S16[4096*2160][17:9]"],
                "Blackmagic URSA Mini Pro 12K_Blackmagic RAW 18:1" : ["12K S35[12288*6480][17:9]","12K S35[11520*6480][16:9]","12K S35[12288*5112][2.4:1]","8K S35[8192*4320][17:9]","8K S35[7680*4320][16:9]","8K S35[8192*3408][2.4:1]","4K S35[4096*2160][17:9]","4K S35[3840*2160][16:9]","4K S35[4096*1704][2.4:1]","6K S16[6144*3240][17:9]","4K S16[4096*2160][17:9]"],
            ]
            resolutions = BMDResolutions[key, default: ["无选项"]]
        }

        return resolutions
    }
